Дашборд разработан с целью наблюдения за отсутствием электронных печатей в организациях, включая как ведомственные, так и подведомственные. В представленном файле DAG предусмотрено ежедневное обновление данных в каждой из таблиц. Кроме того, на втором этапе данного DAG создается цикл для наполнения общей витрины. Для этой цели используется запрос, извлекающий идентификаторы всех организаций.

Кроме того, для создания информативного графика "Динамика по организациям" был применен новый созданный набор данных (dataset). Благодаря этому и расчетному столбцу CASE WHEN rn <= 10 THEN "Организация" ELSE 'Другое' END, можно фильтровать организации, чтобы избежать избыточной информации.

SELECT 
    date_trunc('week', "Дата документа") AS "Дата документа",
    "Организация",
    row_number() OVER (
        PARTITION BY date_trunc('week', "Дата документа") 
        ORDER BY count(*) DESC
    ) AS rn,
    count(*) AS cnt
FROM data_marts.sed_documents_without_ep
GROUP BY 
    date_trunc('week', "Дата документа"),
    "Организация"
Этот запрос позволяет отображать количество документов по организациям на недельной основе, а также применять фильтрацию для удобства визуализации данных.
